Revit 2024 API
Viewport.GetProjectionToSheetTransform Method
 Returns the transform from the view's projection space to the sheet space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public Transform GetProjectionToSheetTransform()
Visual Basic
Public Function GetProjectionToSheetTransform As Transform
Visual C++
public:
Transform^ GetProjectionToSheetTransform()
Return Value
 The transform from the view's projection space to the sheet space.
Remarks
 This transform accounts for the position and rotation of a viewport on a sheet.
 The transforms from the model space to the view projection space are returned by [!:View.GetModelToProjectionTransforms()].
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  The viewport is not on a sheet. -or- The viewport does not have transforms.
See Also
Viewport Class
Autodesk.Revit.DB Namespace